包名 结绳.安卓

@禁止创建对象
类 对齐方式
	@静态
	常量 靠上对齐 : 整数 = 48

	@静态
	常量 靠下对齐 : 整数 = 80

	@静态
	常量 靠左对齐 : 整数 = 3

	@静态
	常量 靠右对齐 : 整数 = 5

	@静态
	常量 居中 : 整数 = 17
结束 类

@禁止创建对象
@常量类型(整数)
@需求值类型(整数)
类 组件可视状态
	@静态
	常量 可视 : 组件可视状态 = 0

	@静态
	常量 不可视 : 组件可视状态 = 4

	@静态
	常量 隐藏 : 组件可视状态 = 8
结束 类

@禁止创建对象
@常量类型(整数)
@需求值类型(整数)
类 触摸手势
	@静态
	常量 左移 : 触摸手势 = 0
	@静态
	常量 右移 : 触摸手势 = 1
	@静态
	常量 上移 : 触摸手势 = 2
	@静态
	常量 下移 : 触摸手势 = 3
	@静态
	常量 左滑 : 触摸手势 = 4
	@静态
	常量 右滑 : 触摸手势 = 5
	@静态
	常量 上滑 : 触摸手势 = 6
	@静态
	常量 下滑 : 触摸手势 = 7
	@静态
	常量 单击 : 触摸手势 = 8
	@静态
	常量 双击 : 触摸手势 = 9
结束 类