包名 结绳.JVM

@指代类("java.util.Vector")
类 并发集合<模板类型1=对象>
	@静态
	@运算符重载
	方法 =(成员 : 模板类型1[]): 并发集合<模板类型1>
		@code
		java.util.Vector<#ncls<模板类型1>> list = new java.util.Vector<>(#成员.length);
		for(#ncls<模板类型1> el : #成员) {
			list.add(el);
		}
		return list;
		@end
	结束 方法

	@运算符重载
	方法 [](索引 : 整数) : 模板类型1
		返回 取成员(索引)
	结束 方法

	@运算符重载
	方法 []=(索引 : 整数,值 : 模板类型1)
		置成员(索引, 值)
	结束 方法

	@运算符重载
	方法 ?(值 : 模板类型1) : 逻辑型
		返回 是否存在(值)
	结束 方法

	方法 是否为空() : 逻辑型
		code return #this.isEmpty();
	结束 方法

	方法 添加成员(成员 : 模板类型1)
		code #this.add(#成员);
	结束 方法

	方法 插入成员(索引 : 整数,成员 : 模板类型1)
		code #this.add(#索引,#成员);
	结束 方法

	方法 置成员(索引 : 整数,成员 : 模板类型1)
		code #this.set(#索引,#成员);
	结束 方法

	方法 取成员(索引 : 整数) : 模板类型1
		code return #this.get(#索引);
	结束 方法

	方法 是否存在(成员 : 模板类型1) : 逻辑型
		code return #this.contains(#成员);
	结束 方法

	方法 寻找成员(成员 : 模板类型1) : 整数
		code return #this.indexOf(#成员);
	结束 方法

	//清空集合
	方法 清空()
		code #this.clear();
	结束 方法

	//删除指定索引处成员
	方法 删除成员(索引 : 整数)
		code #this.remove(#索引);
	结束 方法

	//删除指定成员对象
	方法 删除成员2(成员 : 模板类型1)
		code #this.remove(#成员);
	结束 方法

	/*
	将集合转为数组
	*/
	方法 到数组() : 模板类型1[]
		code return #this.toArray(new #ncls<模板类型1>[0]);
	结束 方法

	方法 打乱集合()
		@code
		for (int i = 0,max = #this.size() - 1;i < max;i++) {
			if (System.nanoTime() % 2 == 0) {
				#ncls<模板类型1> tmp = #this.get(i);
				#this.set(i, #this.get(i + 1));
				#this.set(i + 1, tmp);
			}
		}
		@end
	结束 方法

	属性读 长度() : 整数
		code return #this.size();
	结束 属性

	方法 取遍历器() : 遍历器<模板类型1>
		code return #this.iterator();
	结束 方法
结束 类

@废弃使用("兼容旧版特化类型，建议直接使用 并发集合<元素类型>")
类 并发集合模板类<元素类型> : 并发集合<元素类型>
结束 类

@废弃使用("兼容旧版特化类型，建议直接使用 并发集合<整数类>")
类 并发整数集合 : 并发集合<整数类>
结束 类

@废弃使用("兼容旧版特化类型，建议直接使用 并发集合<文本>")
类 并发文本集合 : 并发集合<文本>
结束 类

@指代类("java.util.concurrent.ConcurrentHashMap")
类 并发哈希表<模板类型1 = 对象,模板类型2 = 对象>
	@运算符重载
	方法 [](键 : 模板类型1) : 模板类型2
		返回 取项目(键)
	结束 方法

	@运算符重载
	方法 []=(键 : 模板类型1, 值 : 模板类型2)
		添加项目(键, 值)
	结束 方法

	@运算符重载
	方法 ?(键 : 模板类型1) : 逻辑型
		返回 是否存在(键)
	结束 方法

	方法 添加项目(键 : 模板类型1,值 : 模板类型2)
		code #this.put(#键, #值);
	结束 方法

	方法 删除项目(键 : 模板类型1)
		code #this.remove(#键);
	结束 方法

	方法 取项目(键 : 模板类型1) : 模板类型2
		code return #this.get(#键);
	结束 方法

	方法 是否存在(键 : 模板类型1) : 逻辑型
		code return #this.containsKey(#键);
	结束 方法

	方法 清空()
		code #this.clear();
	结束 方法

	属性读 长度() : 整数
		code return #this.size();
	结束 属性
结束 类

@废弃使用("兼容旧版特化类型，建议直接使用 并发哈希表<键类型, 值类型>")
类 并发哈希表模板类<键类型, 值类型> : 并发哈希表<键类型, 值类型>
结束 类
